huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
MINI58.menu.cpu.MINI58_33=GENERIC_MINI58T/Z(QFN33)(32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58_33.build.extra_flags=-DCHIP33P -DMINI58TZ
MINI58.menu.cpu.MINI58_33.build.variant=MINI58
MINI58.menu.cpu.MINI58_33.build.board=GENERIC_MINI58TZ
MINI58.menu.cpu.MINI58_33.build.series=Mini58Series
MINI58.menu.cpu.MINI58_33.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58_33.upload.maximum_size=32768
MINI58.menu.cpu.MINI58_33.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58_33.upload.device=MINI58TAN

MINI58.menu.cpu.MINI58_20=GENERIC_MINI58F(TSSOP20)(32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58_20.build.extra_flags=-DCHIP20P -DMINI58F
MINI58.menu.cpu.MINI58_20.build.variant=MINI58
MINI58.menu.cpu.MINI58_20.build.board=GENERIC_MINI58F
MINI58.menu.cpu.MINI58_20.build.series=Mini58Series
MINI58.menu.cpu.MINI58_20.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58_20.upload.maximum_size=32768
MINI58.menu.cpu.MINI58_20.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58_20.upload.device=MINI58FAN

MINI58.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
MINI58.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
MINI58.menu.clock_source.HXT125=HXT_12M(50MMHz)
MINI58.menu.clock_source.HXT125.build.f_cpu=50000000L -DHXT12
#MINI58.menu.clock_source.HXT1210=HXT_12M(100MMHz)
#MINI58.menu.clock_source.HXT1210.build.f_cpu=100000000L -DHXT12

MINI58.menu.serial.UART0=Serial0(P1_2/3)
MINI58.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
MINI58.menu.serial.UART1=Serial1(P1_4/5)
MINI58.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
MINI58.menu.serial.NuICE=Nulink console
MINI58.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
MINI58.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
MINI58.menu.log.default=Release(no-exceptions)
MINI58.menu.log.default.build.log_level=-fno-exceptions
MINI58.menu.log.Release=Release(exceptions)
MINI58.menu.log.fatal=FATAL
MINI58.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
MINI58.menu.log.error=ERROR
MINI58.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
MINI58.menu.log.warning=WARNING
MINI58.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
MINI58.menu.log.info=INFO
MINI58.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
MINI58.menu.log.debug=DEBUG
MINI58.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
MINI58.menu.log.trace=TRACE
MINI58.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

MINI58.menu.upload_method.nulink=Nulink
MINI58.menu.upload_method.nulink.upload.tool=nulinkburn
MINI58.menu.upload_method.nulink.upload.protocol=nuc-ba
MINI58.menu.upload_method.nulink.upload.use_1200bps_touch=false
MINI58.menu.upload_method.nulink.upload.wait_for_upload_port=false
MINI58.menu.upload_method.nulink.upload.native_usb=false

MINI58.menu.upload_method.jLinkMethod=JLink
MINI58.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
MINI58.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                  nuvoton mini5X                      #
########################################################
MINI5x.name=Mini54

MINI5x.build.core=nuvoton
MINI5x.build.mcu=cortex-m0
MINI5x.build.f_cpu=22118400L
MINI5x.build.variant=MINI58
MINI5x.build.board=GENERIC_MINI58FDE

MINI5x.menu.cpu.MINI54_48=GENERIC_MINI54L(LQP48)  (16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54_48.build.extra_flags=-DCHIP48P -DMINI54L
MINI5x.menu.cpu.MINI54_48.build.variant=MINI51
MINI5x.menu.cpu.MINI54_48.build.board=GENERIC_MINI54L
MINI5x.menu.cpu.MINI54_48.build.series=Mini51Series
MINI5x.menu.cpu.MINI54_48.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54_48.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54_48.upload.maximum_data_size=4096
MINI5x.menu.cpu.MINI54_48.upload.device=MINI54LAN

MINI5x.menu.cpu.MINI54_33=GENERIC_MINI54T/Z(QEN33)(16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54_33.build.extra_flags=-DCHIP33P -DMINI54TZ
MINI5x.menu.cpu.MINI54_33.build.variant=MINI51
MINI5x.menu.cpu.MINI54_33.build.board=GENERIC_MINI54TZ
MINI5x.menu.cpu.MINI54_33.build.series=Mini51Series
MINI5x.menu.cpu.MINI54_33.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54_33.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54_33.upload.maximum_data_size=4096
MINI5x.menu.cpu.MINI54_33.upload.device=MINI54TAN

MINI5x.menu.cpu.MINI54_20=GENERIC_MINI54F(TSSOP20)(16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54_20.build.extra_flags=-DCHIP20P -DMINI54F
MINI5x.menu.cpu.MINI54_20.build.variant=MINI51
MINI5x.menu.cpu.MINI54_20.build.board=GENERIC_MINI54F
MINI5x.menu.cpu.MINI54_20.build.series=Mini51Series
MINI5x.menu.cpu.MINI54_20.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54_20.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54_20.upload.maximum_data_size=4096
MINI5x.menu.cpu.MINI54_20.upload.device=MINI54FAN

#MINI5x.menu.cpu.MINI52_48=GENERIC_MINI52L(LQP48)   (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52_48.build.extra_flags=-DCHIP48P -DMINI52L
#MINI5x.menu.cpu.MINI52_48.build.variant=MINI51
#MINI5x.menu.cpu.MINI52_48.build.board=GENERIC_MINI52L
#MINI5x.menu.cpu.MINI52_48.build.series=Mini51Series
#MINI5x.menu.cpu.MINI52_48.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52_48.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52_48.upload.maximum_data_size=2048

#MINI5x.menu.cpu.MINI52_33=GENERIC_MINI52T/Z(QEN33) (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52_33.build.extra_flags=-DCHIP33P -DMINI52TZ
#MINI5x.menu.cpu.MINI52_33.build.variant=MINI51
#MINI5x.menu.cpu.MINI52_33.build.board=GENERIC_MINI52TZ
#MINI5x.menu.cpu.MINI52_33.build.series=Mini51Series
#MINI5x.menu.cpu.MINI52_33.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52_33.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52_33.upload.maximum_data_size=2048

#MINI5x.menu.cpu.MINI52_20=GENERIC_MINI52F(TSSOP20) (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52_20.build.extra_flags=-DCHIP20P -DMINI52F
#MINI5x.menu.cpu.MINI52_20.build.variant=MINI51
#MINI5x.menu.cpu.MINI52_20.build.board=GENERIC_MINI52F
#MINI5x.menu.cpu.MINI52_20.build.series=Mini51Series
#MINI5x.menu.cpu.MINI52_20.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52_20.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52_20.upload.maximum_data_size=2048

MINI5x.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
MINI5x.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
MINI5x.menu.clock_source.HXT125=HXT_12M(50MMHz)
MINI5x.menu.clock_source.HXT125.build.f_cpu=50000000L -DHXT12
#MINI5x.menu.clock_source.HXT1210=HXT_12M(100MMHz)
#MINI5x.menu.clock_source.HXT1210.build.f_cpu=100000000L -DHXT12

MINI5x.menu.serial.UART0=Serial0(P1_2/3)
MINI5x.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
MINI5x.menu.serial.NuICE=Nulink console
MINI5x.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
MINI5x.menu.serial.NuICE.upload.console=NUCONSOLE

